#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  
  УстановитьОграничениеТипа();
  
КонецПроцедуры

&НаКлиенте
Процедура КлючПравилаПриИзменении(Элемент)
	
	//NOTE: при изменении ключа
	
  УстановитьОграничениеТипа();
  
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипа()
	
	//NOTE: это ограничение на само значение по ключу
	
  Значение = Элементы.Значение;
  ОграничениеТипа = СвязиТиповКлючей().Получить(Запись.КлючПравила);
  Если ОграничениеТипа = Неопределено Тогда     
    ОграничениеТипа = Метаданные.РегистрыСведений.ПравилаОтбораСистемОбмена.Ресурсы.Значение.Тип;    
  КонецЕсли;  
  Значение.ОграничениеТипа = ОграничениеТипа;  
  
КонецПроцедуры


&НаСервереБезКонтекста
Функция СвязиТиповКлючей()
	
	//NOTE: это связь ключей к значениям
	
	СвязиТипов = новый Соответствие;
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.АдресаДоставкиПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.АдресаДоставкиПравилаОтбора"));
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.КонтрагентыПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.КонтрагентыПравилаОтбора"));
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.НоменклатураПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.НоменклатураПравилаОтбора"));
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.ОрганизацииПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.ОрганизацииПравилаОтбора"));
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.КассыПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.КассыПравилаОтбора"));
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.ОсновныеСредстваПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредстваПравилаОтбора"));
  СвязиТипов.Вставить(ПредопределенноеЗначение("Справочник.КлючиПравилОтбора.ТипыЦенНоменклатурыПравилоОтбора"),
            Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатурыПравилаОтбора"));        

  Возврат СвязиТипов;          
  
КонецФункции
