
&НаКлиенте
Процедура УдалитьПолностью(Команда)
	УдалитьПолностьюНаСервере(Сетки, Слоты);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Ок";
	Сообщение.Сообщить(); 
КонецПроцедуры

&НаСервере
Процедура УдалитьПолностьюНаСервере(УдалятьСетки, УдалятьСлоты)
	
	Если УдалятьСетки Тогда	
		
		Выборка = Документы.слм_ТелевизионнаяСетка.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			документобъект = Выборка.ПолучитьОбъект();
			документобъект.Удалить();
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если УдалятьСлоты Тогда
		
		Выборка = Документы.слм_ТаймСлот.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			документобъект = Выборка.ПолучитьОбъект();
			документобъект.Удалить();
			
		КонецЦикла; 
		
		
	КонецЕсли; 
	
	
КонецПроцедуры
