
&НаКлиенте
Процедура ОбъединитьЯчейки(Команда)
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная,1);
	ТекущаяОбласть().Обвести(Линия,Линия,Линия,Линия);
	ТекущаяОбласть().Объединить();	
	
КонецПроцедуры


&НаКлиенте
Функция ТекущаяОбласть()
	Возврат Элементы.ТабличныйДокумент.ТекущаяОбласть;
КонецФункции //ТекущаяОбласть

&НаКлиенте
Процедура ОткрытьМиниФорму(Команда)
	ОткрытьФорму("Документ.слм_ТаймСлот.Форма.ФормаБыстрогоРедактирования", , ЭтотОбъект, УникальныйИдентификатор, АктивноеОкно(),,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
