
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектыЗаполнения = Новый Массив;
	ОбъектыЗаполнения.Добавить(Метаданные.Справочники.слм_Жанры);
	ОбъектыЗаполнения.Добавить(Метаданные.Справочники.слм_КатегорииПоЛицензииКанала);
	ОбъектыЗаполнения.Добавить(Метаданные.Справочники.слм_ВидыКвот);
	ОбъектыЗаполнения.Добавить(Метаданные.Справочники.слм_ТипыКонтента);
	ОбъектыЗаполнения.Добавить(Метаданные.Справочники.слм_ДниНедели);
	
	
	Для каждого ОбъектЗаполнения Из ОбъектыЗаполнения Цикл
		РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(СтрШаблон("%1.%2.ЗаполнитьСправочникПоМакету",ОбщегоНазначения.ИмяТипаСправочники(),ОбъектЗаполнения.Имя)); 		
	КонецЦикла; 
	 
	
КонецПроцедуры
