#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Шаг = "Шаг60";
	ПоКакойЧас = 24;
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	ТабличныйДокумент.Очистить();
	
	Макет = Документы.слм_ТелевизионнаяСетка.ПолучитьМакет("ШкалаСетки");
	
	Для каждого _ДеньНедели Из Перечисления.слм_ДниНедели Цикл
		
		Область = Макет.ПолучитьОбласть(_ДеньНедели);
		ТабличныйДокумент.Присоединить(Область);
		
	КонецЦикла; 
	
	
	//TODO: сделать кэш строки сетки, с учетом смещения	
	ОписаниеКоординат = НовыйОписаниеКоординат();	
	// константы
	ЧасовВСутках = 24;
	МинутВЧасе = 60;
	
	Если Шаг = "Шаг60" Тогда
		
		НайденнаяСтрока = ОписаниеКоординат.Найти(1,"Смещение");
		
		Для Счетчик = НачалоСмещения По Мин(НайденнаяСтрока.Смещение * ЧасовВСутках, НайденнаяСтрока.Смещение * ПоКакойЧас) Цикл
			
			ОбластьТаймСлота = Макет.ПолучитьОбласть("ТаймСлот");
			ОбластьТаймСлота.Параметры.ТаймСлот = Формат(Дата('19000101000000' + ((Счетчик * НайденнаяСтрока.Минуты * 60))),"ДФ=HH:мм");
			ТабличныйДокумент.Присоединить(ОбластьТаймСлота);		
			
		КонецЦикла;	
		
	ИначеЕсли Шаг = "Шаг30" Тогда
		
		НайденнаяСтрока = ОписаниеКоординат.Найти(2,"Смещение");
		
		Для Счетчик = НачалоСмещения * НайденнаяСтрока.Смещение По Мин(НайденнаяСтрока.Смещение * ЧасовВСутках, НайденнаяСтрока.Смещение * ПоКакойЧас) Цикл 
			
			ОбластьТаймСлота = Макет.ПолучитьОбласть("ТаймСлот");
			ОбластьТаймСлота.Параметры.ТаймСлот = Формат(Дата('19000101000000' + ((Счетчик * НайденнаяСтрока.Минуты * 60))),"ДФ=HH:мм");
			ТабличныйДокумент.Присоединить(ОбластьТаймСлота);
			
		КонецЦикла; 
		
		
	ИначеЕсли Шаг = "Шаг15" Тогда 
		
		НайденнаяСтрока = ОписаниеКоординат.Найти(4,"Смещение");
		
		Для Счетчик = НачалоСмещения * НайденнаяСтрока.Смещение По Мин(НайденнаяСтрока.Смещение * ЧасовВСутках, НайденнаяСтрока.Смещение * ПоКакойЧас) Цикл 
			
			ОбластьТаймСлота = Макет.ПолучитьОбласть("ТаймСлот");
			ОбластьТаймСлота.Параметры.ТаймСлот = Формат(Дата('19000101000000' + ((Счетчик * НайденнаяСтрока.Минуты * 60))),"ДФ=HH:мм");
			ТабличныйДокумент.Присоединить(ОбластьТаймСлота);
			
		КонецЦикла; 
		
	Иначе		
		ВызватьИсключение нСтр("ru = 'Не указан шаг'") ;
	КонецЕсли;
	
	//Для Счетчик = 0 По ЧасовВСутках * 2 Цикл
	//	
	//	ОбластьТаймСлота = Макет.ПолучитьОбласть("ТаймСлот");
	//	ОбластьТаймСлота.Параметры.ТаймСлот =  Формат(Дата('19000101000000' + ((Счетчик * МинутВЧасе/2 * 60))),"ДФ=HH:мм");
	//	ТабличныйДокумент.Присоединить(ОбластьТаймСлота);
	//	
	//КонецЦикла;
	
	//Для Счетчик = НачалоСмещения По ЧасовВСутках * 4 Цикл
	//	
	//	ОбластьТаймСлота = Макет.ПолучитьОбласть("ТаймСлот");
	//	ОбластьТаймСлота.Параметры.ТаймСлот =  Формат(Дата('19000101000000' + ((Счетчик * МинутВЧасе/4 * 60))),"ДФ=HH:мм");
	//	ТабличныйДокумент.Присоединить(ОбластьТаймСлота);
	//	
	//КонецЦикла; 	
	
	ТабличныйДокумент.ФиксацияСверху 	= 1;
	ТабличныйДокумент.ФиксацияСлева 	= 1;
	
КонецПроцедуры

&НаСервере
Функция НовыйОписаниеКоординат()
	
	ЦелоеЧисло 		= ОбщегоНазначения.ОписаниеТипаЧисло(2,0,ДопустимыйЗнак.Неотрицательный);
	Строка150 		= ОбщегоНазначения.ОписаниеТипаСтрока(150);
	Дискретность 	= Новый ОписаниеТипов("ПеречислениеСсылка.слм_ДискретностьШкалы");
	
	ОписаниеТаблицыКоординат = Новый ТаблицаЗначений;
	ОписаниеТаблицыКоординат.Колонки.Добавить("Дискретность",	Дискретность);
	ОписаниеТаблицыКоординат.Колонки.Добавить("Смещение", 		ЦелоеЧисло);
	ОписаниеТаблицыКоординат.Колонки.Добавить("Минуты", 		ЦелоеЧисло);
	ОписаниеТаблицыКоординат.Колонки.Добавить("Описание",  		Строка150);
	
	НоваяЗапись = ОписаниеТаблицыКоординат.Добавить();
	НоваяЗапись.Дискретность = Перечисления.слм_ДискретностьШкалы._60;
	НоваяЗапись.Смещение 	= 1;
	НоваяЗапись.Минуты 		= 60;
	НоваяЗапись.Описание	= нСтр("ru = '1 /60 минут в интервале'"); 
	
	НоваяЗапись = ОписаниеТаблицыКоординат.Добавить();
	НоваяЗапись.Дискретность = Перечисления.слм_ДискретностьШкалы._30;
	НоваяЗапись.Смещение 	= 2;
	НоваяЗапись.Минуты 		= 30;
	НоваяЗапись.Описание	= нСтр("ru = '30 минут/30 минут в интервале'");
	
	НоваяЗапись = ОписаниеТаблицыКоординат.Добавить();
	НоваяЗапись.Дискретность = Перечисления.слм_ДискретностьШкалы._15;
	НоваяЗапись.Смещение 	= 4;
	НоваяЗапись.Минуты 		= 15; 
	НоваяЗапись.Описание	= нСтр("ru = '15 минут/ 15 минут в интервале'");	
	
	Возврат ОписаниеТаблицыКоординат;
	
КонецФункции

&НаКлиенте
Процедура Перезаполнить(Команда)
	ПерезаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаСервере()
	ИнициализироватьТабличныйДокумент();
КонецПроцедуры

#КонецОбласти